{"Quantum Koopman Method": {"2510.23078": "|**2025-10-27**|**Numerical Spectrum Linking: Identification of Governing PDE via Koopman-Chebyshev Approximation**|Shogo Muramatsu|math.NA; cs.NA; eess.SP|[2510.23078](http://arxiv.org/abs/2510.23078)|Submitted to IEEE ICASSP 2026|A numerical framework is proposed for identifying partial differential equations (PDEs) governing dynamical systems directly from their observation data using Chebyshev polynomial approximation. In contrast to data-driven approaches such as dynamic mode decomposition (DMD), which approximate the Koopman operator without a clear connection to differential operators, the proposed method constructs finite-dimensional Koopman matrices by projecting the dynamics onto a Chebyshev basis, thereby capturing both differential and nonlinear terms. This establishes a numerical link between the Koopman and differential operators. Numerical experiments on benchmark dynamical systems confirm the accuracy and efficiency of the approach, underscoring its potential for interpretable operator learning. The framework also lays a foundation for future integration with symbolic regression, enabling the construction of explicit mathematical models directly from data.|\n", "2510.22002": "|**2025-10-24**|**An Introductory Guide to Koopman Learning**|Andrew Horning|math.NA; cs.LG; cs.NA; math.DS; math.OC; math.SP|[2510.22002](http://arxiv.org/abs/2510.22002)||Koopman operators provide a linear framework for data-driven analyses of nonlinear dynamical systems, but their infinite-dimensional nature presents major computational challenges. In this article, we offer an introductory guide to Koopman learning, emphasizing rigorously convergent data-driven methods for forecasting and spectral analysis. We provide a unified account of error control via residuals in both finite- and infinite-dimensional settings, an elementary proof of convergence for generalized Laplace analysis -- a variant of filtered power iteration that works for operators with continuous spectra and no spectral gaps -- and review state-of-the-art approaches for computing continuous spectra and spectral measures. The goal is to provide both newcomers and experts with a clear, structured overview of reliable data-driven techniques for Koopman spectral analysis.|\n", "2510.21308": "|**2025-10-24**|**Data-driven Koopman MPC using Mixed Stochastic-Deterministic Tubes**|Panagiotis Petsagkourakis|eess.SY; cs.SY|[2510.21308](http://arxiv.org/abs/2510.21308)|This is the accepted version. It will appear in Journal of Process\n  Control, 2025|This paper presents a novel data-driven stochastic MPC design for discrete-time nonlinear systems with additive disturbances by leveraging the Koopman operator and a distributionally robust optimization (DRO) framework. By lifting the dynamical system into a linear space, we achieve a finite-dimensional approximation of the Koopman operator. We explicitly account for the modeling approximation and additive disturbance error by a mixed stochastic-deterministic tube for the lifted linear model. This ensures the regulation of the original nonlinear system while complying with the prespecified constraints. Stochastic and deterministic tubes are constructed using a DRO and a hyper-cube hull, respectively. We provide finite sample error bounds for both types of tubes. The effectiveness of the proposed approach is demonstrated through numerical simulations.|\n", "2510.15166": "|**2025-10-16**|**Two Roads to Koopman Operator Theory for Control: Infinite Input Sequences and Operator Families**|Jorge Cortés|math.OC; cs.SY; eess.SY; math.DS|[2510.15166](http://arxiv.org/abs/2510.15166)||The Koopman operator, originally defined for dynamical systems without input, has inspired many applications in control. Yet, the theoretical foundations underpinning this progress in control remain underdeveloped. This paper investigates the theoretical structure and connections between two extensions of Koopman theory to control: (i) Koopman operator via infinite input sequences and (ii) the Koopman control family. Although these frameworks encode system information in fundamentally different ways, we show that under certain conditions on the function spaces they operate on, they are equivalent. The equivalence is both in terms of the actions of the Koopman-based formulations in each framework as well as the function values on the system trajectories. Our analysis provides constructive tools to translate between the frameworks, offering a unified perspective for Koopman methods in control.|\n", "2510.13025": "|**2025-10-14**|**Information Shapes Koopman Representation**|Zhuo Sun|cs.LG; cs.SY; eess.SY|[2510.13025](http://arxiv.org/abs/2510.13025)||The Koopman operator provides a powerful framework for modeling dynamical systems and has attracted growing interest from the machine learning community. However, its infinite-dimensional nature makes identifying suitable finite-dimensional subspaces challenging, especially for deep architectures. We argue that these difficulties come from suboptimal representation learning, where latent variables fail to balance expressivity and simplicity. This tension is closely related to the information bottleneck (IB) dilemma: constructing compressed representations that are both compact and predictive. Rethinking Koopman learning through this lens, we demonstrate that latent mutual information promotes simplicity, yet an overemphasis on simplicity may cause latent space to collapse onto a few dominant modes. In contrast, expressiveness is sustained by the von Neumann entropy, which prevents such collapse and encourages mode diversity. This insight leads us to propose an information-theoretic Lagrangian formulation that explicitly balances this tradeoff. Furthermore, we propose a new algorithm based on the Lagrangian formulation that encourages both simplicity and expressiveness, leading to a stable and interpretable Koopman representation. Beyond quantitative evaluations, we further visualize the learned manifolds under our representations, observing empirical results consistent with our theoretical predictions. Finally, we validate our approach across a diverse range of dynamical systems, demonstrating improved performance over existing Koopman learning methods. The implementation is publicly available at https://github.com/Wenxuan52/InformationKoopman.|\n", "2510.12220": "|**2025-10-14**|**Hierarchical Koopman Diffusion: Fast Generation with Interpretable Diffusion Trajectory**|Difan Zou|cs.LG|[2510.12220](http://arxiv.org/abs/2510.12220)|NeurIPS 2025|Diffusion models have achieved impressive success in high-fidelity image generation but suffer from slow sampling due to their inherently iterative denoising process. While recent one-step methods accelerate inference by learning direct noise-to-image mappings, they sacrifice the interpretability and fine-grained control intrinsic to diffusion dynamics, key advantages that enable applications like editable generation. To resolve this dichotomy, we introduce \\textbf{Hierarchical Koopman Diffusion}, a novel framework that achieves both one-step sampling and interpretable generative trajectories. Grounded in Koopman operator theory, our method lifts the nonlinear diffusion dynamics into a latent space where evolution is governed by globally linear operators, enabling closed-form trajectory solutions. This formulation not only eliminates iterative sampling but also provides full access to intermediate states, allowing manual intervention during generation. To model the multi-scale nature of images, we design a hierarchical architecture that disentangles generative dynamics across spatial resolutions via scale-specific Koopman subspaces, capturing coarse-to-fine details systematically. We empirically show that the Hierarchical Koopman Diffusion not only achieves competitive one-step generation performance but also provides a principled mechanism for interpreting and manipulating the generative process through spectral analysis. Our framework bridges the gap between fast sampling and interpretability in diffusion models, paving the way for explainable image synthesis in generative modeling.|\n", "2510.09082": "|**2025-10-10**|**Physics-Informed High-order Graph Dynamics Identification Learning for Predicting Complex Networks Long-term Dynamics**|Yibo Xue|cs.AI; cs.CY; cs.SI; physics.soc-ph|[2510.09082](http://arxiv.org/abs/2510.09082)||Learning complex network dynamics is fundamental to understanding, modelling and controlling real-world complex systems. There are two main problems in the task of predicting the dynamic evolution of complex networks: on the one hand, existing methods usually use simple graphs to describe the relationships in complex networks; however, this approach can only capture pairwise relationships, while there may be rich non-pairwise structured relationships in the network. First-order GNNs have difficulty in capturing dynamic non-pairwise relationships. On the other hand, theoretical prediction models lack accuracy and data-driven prediction models lack interpretability. To address the above problems, this paper proposes a higher-order network dynamics identification method for long-term dynamic prediction of complex networks. Firstly, to address the problem that traditional graph machine learning can only deal with pairwise relations, dynamic hypergraph learning is introduced to capture the higher-order non-pairwise relations among complex networks and improve the accuracy of complex network modelling. Then, a dual-driven dynamic prediction module for physical data is proposed. The Koopman operator theory is introduced to transform the nonlinear dynamical differential equations for the dynamic evolution of complex networks into linear systems for solving. Meanwhile, the physical information neural differential equation method is utilised to ensure that the dynamic evolution conforms to the physical laws. The dual-drive dynamic prediction module ensures both accuracy and interpretability of the prediction. Validated on public datasets and self-built industrial chain network datasets, the experimental results show that the method in this paper has good prediction accuracy and long-term prediction performance.|\n", "2510.09042": "|**2025-10-10**|**MAKO: Meta-Adaptive Koopman Operators for Learning-based Model Predictive Control of Parametrically Uncertain Nonlinear Systems**|Xunyuan Yin|eess.SY; cs.LG; cs.SY|[2510.09042](http://arxiv.org/abs/2510.09042)||In this work, we propose a meta-learning-based Koopman modeling and predictive control approach for nonlinear systems with parametric uncertainties. An adaptive deep meta-learning-based modeling approach, called Meta Adaptive Koopman Operator (MAKO), is proposed. Without knowledge of the parametric uncertainty, the proposed MAKO approach can learn a meta-model from a multi-modal dataset and efficiently adapt to new systems with previously unseen parameter settings by using online data. Based on the learned meta Koopman model, a predictive control scheme is developed, and the stability of the closed-loop system is ensured even in the presence of previously unseen parameter settings. Through extensive simulations, our proposed approach demonstrates superior performance in both modeling accuracy and control efficacy as compared to competitive baselines.|\n", "2510.05863": "|**2025-10-07**|**Analog and Symbolic Computation through the Koopman Framework**|Jean-Charles Delvenne|math-ph; cs.LO; cs.SC; math.MP; nlin.CG|[2510.05863](http://arxiv.org/abs/2510.05863)|13 pages double column; two figures|We develop a Koopman operator framework for studying the {computational properties} of dynamical systems. Specifically, we show that the resolvent of the Koopman operator provides a natural abstraction of halting, yielding a ``Koopman halting problem that is recursively enumerable in general. For symbolic systems, such as those defined on Cantor space, this operator formulation captures the reachability between clopen sets, while for equicontinuous systems we prove that the Koopman halting problem is decidable. Our framework demonstrates that absorbing (halting) states {in finite automata} correspond to Koopman eigenfunctions with eigenvalue one, while cycles in the transition graph impose algebraic constraints on spectral properties. These results provide a unifying perspective on computation in symbolic and analog systems, showing how computational universality is reflected in operator spectra, invariant subspaces, and algebraic structures. Beyond symbolic dynamics, this operator-theoretic lens opens pathways to analyze {computational power of} a broader class of dynamical systems, including polynomial and analog models, and suggests that computational hardness may admit dynamical signatures in terms of Koopman spectral structure.|\n", "2510.05359": "|**2025-10-06**|**Koopman Control Factorization: Data-Driven Convex Controller Design for a Class of Nonlinear Systems**|Roberto Tron|eess.SY; cs.SY|[2510.05359](http://arxiv.org/abs/2510.05359)|8 pages, 1 figure (with 4 subfigures). Submitted to the 2026 American\n  Control Conference (ACC)|Although Koopman operators provide a global linearization for autonomous dynamical systems, nonautonomous systems are not globally linear in the inputs. State (or output) feedback controller design therefore remains nonconvex in typical formulations, even with approximations via bilinear control-affine terms. We address this gap by introducing the Koopman Control Factorization, a novel parameterization of control-affine dynamical systems combined with a feedback controller defined as a linear combination of nonlinear measurements. With this choice, the Koopman operator of the closed-loop system is a bilinear combination of the coefficients in two matrices: one representing the system, and the other the controller. We propose a set of sufficient conditions such that the factorization holds. Then, we present an algorithm that calculates the feedback matrix via semi-definite programming, producing a Lyapunov-stable closed-loop system with convex optimization. We evaluate the proposed controllers on two canonical examples of control-affine nonlinear systems (inverted pendulums), and show that our factorization and controller successfully stabilize both under properly-chosen basis functions. This manuscript introduces a broadly generalizable control synthesis method for stabilization of nonlinear systems that is quick-to-compute, verifiably stable, data-driven, and does not rely on approximations.|\n"}, "Quantum Machine Learning": {"2510.25675": "|**2025-10-29**|**Quantum simulation of actinide chemistry: towards scalable algorithms on trapped ion quantum computers**|David Munoz Ramo|quant-ph; physics.chem-ph|[2510.25675](http://arxiv.org/abs/2510.25675)||Due to the wide range of technical applications of actinide elements, a thorough understanding of their electronic structure could complement technological improvements in many different areas. Quantum computing could greatly aid in this understanding, as it can potentially provide exponential speedups over classical approaches, thereby offering insights into the complex electronic structure of actinide compounds. As a first foray into quantum computational chemistry of actinides, this paper compares the method of quantum computed moments (QCM) as a noisy intermediate-scale quantum algorithm with a single-ancilla version of quantum phase estimation (QPE), a quantum algorithm expected to run on fault-tolerant quantum computers. We employ these algorithms to study the reaction energetics of plutonium oxides and hydrides. In order to enable quantum hardware experiments, we use several techniques to reduce resource requirements: screening individual Hamiltonian Pauli terms to reduce the measurement requirements of QCM and variational compilation to reduce the depth of QPE circuits. Finally, we derive electronic structure descriptions from a series of representative chemical models and compute the energetics from quantum experiments on Quantinuum's H-series ion trap devices using up to 19 qubits. We find our experiments to be in excellent agreement with results from classical electronic structure calculations and state vector simulations.|\n", "2510.25449": "|**2025-10-29**|**Variational quantum computing for quantum simulation: principles, implementations, and challenges**|Clebson Cruz|quant-ph; physics.comp-ph|[2510.25449](http://arxiv.org/abs/2510.25449)|20 pages, 5 figures, 9 example boxes|This work presents a comprehensive overview of variational quantum computing and their key role in advancing quantum simulation. This work explores the simulation of quantum systems and sets itself apart from approaches centered on classical data processing, by focusing on the critical role of quantum data in Variational Quantum Algorithms (VQA) and Quantum Machine Learning (QML). We systematically delineate the foundational principles of variational quantum computing, establish their motivational and challenges context within the noisy intermediate-scale quantum (NISQ) era, and critically examine their application across a range of prototypical quantum simulation problems. Operating within a hybrid quantum-classical framework, these algorithms represent a promising yet problem-dependent pathway whose practicality remains contingent on trainability and scalability under noise and barren-plateau constraints.This review serves to complement and extend existing literature by synthesizing the most recent advancements in the field and providing a focused perspective on the persistent challenges and emerging opportunities that define the current landscape of variational quantum computing for quantum simulation.|\n", "2510.24911": "|**2025-10-28**|**Classically Prepared, Quantumly Evolved: Hybrid Algorithm for Molecular Spectra**|Filippo Vicentini|quant-ph; cond-mat.mtrl-sci; physics.chem-ph; physics.comp-ph|[2510.24911](http://arxiv.org/abs/2510.24911)|9+4 pages, 3+2 figures|We introduce a hybrid classical-quantum algorithm to compute dynamical correlation functions and excitation spectra in many-body quantum systems, with a focus on molecular systems. The method combines classical preparation of a perturbed ground state with short-time quantum evolution of product states sampled from it. The resulting quantum samples define an effective subspace of the Hilbert space, onto which the Hamiltonian is projected to enable efficient classical simulation of long-time dynamics. This subspace-based approach achieves high-resolution spectral reconstruction using shallow circuits and few samples. Benchmarks on molecular systems show excellent agreement with exact diagonalization and demonstrate access to dynamical timescales beyond the reach of purely classical methods, highlighting its suitability for near-term and early fault-tolerant quantum hardware.|\n", "2510.24681": "|**2025-10-28**|**Renormalization-group-based preparation of matrix product states on up to 80 qubits**|Daniel Malz|quant-ph|[2510.24681](http://arxiv.org/abs/2510.24681)|8 pages, 6 figures|A key challenge for quantum computers is the efficient preparation of many-body entangled states across many qubits. In this work, we demonstrate the preparation of matrix product states (MPS) using a renormalization-group(RG)-based quantum algorithm on superconducting quantum hardware. Compared to sequential generation, it has been shown that the RG-based protocol asymptotically prepares short-range correlated MPS with an exponentially shallower circuit depth (when scaling system size), but it is not yet clear for which system sizes it starts to convey an advantage. We thus apply this algorithm to prepare a class of MPS exhibiting a phase transition between a symmetry-protected topological (SPT) and a trivial phase for systems of up to 80 qubits. We find that the reduced depth of the RG-based circuits makes them more resilient to noise, and that they generally outperform the sequential circuits for large systems, as we showcase by measuring string-order-like local expectation values and energy densities. We thus demonstrate that the RG-based protocol enables large-scale preparation of MPS and, in particular, SPT-ordered states beyond the fixed point.|\n", "2510.24598": "|**2025-10-28**|**A Novel XAI-Enhanced Quantum Adversarial Networks for Velocity Dispersion Modeling in MaNGA Galaxies**|Aman Chadha|cs.LG; cs.CR|[2510.24598](http://arxiv.org/abs/2510.24598)||Current quantum machine learning approaches often face challenges balancing predictive accuracy, robustness, and interpretability. To address this, we propose a novel quantum adversarial framework that integrates a hybrid quantum neural network (QNN) with classical deep learning layers, guided by an evaluator model with LIME-based interpretability, and extended through quantum GAN and self-supervised variants. In the proposed model, an adversarial evaluator concurrently guides the QNN by computing feedback loss, thereby optimizing both prediction accuracy and model explainability. Empirical evaluations show that the Vanilla model achieves RMSE = 0.27, MSE = 0.071, MAE = 0.21, and R^2 = 0.59, delivering the most consistent performance across regression metrics compared to adversarial counterparts. These results demonstrate the potential of combining quantum-inspired methods with classical architectures to develop lightweight, high-performance, and interpretable predictive models, advancing the applicability of QML beyond current limitations.|\n", "2510.24348": "|**2025-10-28**|**Tight Generalization Bound for Supervised Quantum Machine Learning**|Rebing Wu|quant-ph|[2510.24348](http://arxiv.org/abs/2510.24348)|21 pages, 14 figures|We derive a tight generalization bound for quantum machine learning that is applicable to a wide range of supervised tasks, data, and models. Our bound is both efficiently computable and free of big-O notation. Furthermore, we point out that previous bounds relying on big-O notation may provide misleading suggestions regarding the generalization error. Our generalization bound demonstrates that for quantum machine learning models of arbitrary size and depth, the sample size is the most dominant factor governing the generalization error. Additionally, the spectral norm of the measurement observable, the bound and Lipschitz constant of the selected risk function also influence the generalization upper bound. However, the number of quantum gates, the number of qubits, data encoding methods, and hyperparameters chosen during the learning process such as batch size, epochs, learning rate, and optimizer do not significantly impact the generalization capability of quantum machine learning. We experimentally demonstrate the tightness of our generalization bound across classification and regression tasks. Furthermore, we show that our tight generalization upper bound holds even when labels are completely randomized. We thus bring clarity to the fundamental question of generalization in quantum machine learning.|\n", "2510.24218": "|**2025-10-28**|**Pilot-Wave Simulator: Exact Classical Sampling from Ideal and Noisy Quantum Circuits up to Hundreds of Qubits**|Man-Hong Yung|quant-ph|[2510.24218](http://arxiv.org/abs/2510.24218)||Quantum circuit simulators running on classical computers offer a vital platform for designing, testing, and optimizing quantum algorithms, driving innovation despite limited access to real quantum hardware. However, their scalability is inherently constrained by exponential memory and computational overhead, which restricts accurate simulation of large-scale quantum circuits and often results in approximate output distributions. Here, we propose an exact sampling algorithm that integrates tensor network contraction techniques with a Markov process, wherein a classical state evolves according to the local structure of the quantum circuit. As a demonstration, we target the challenge of generating samples from ideal and noisy QAOA circuits with up to 476 qubits, incorporating both depolarizing and amplitude damping noise models. These results enable further validation of several assumptions and conjectures at a scale previously out of reach, significantly expanding the scope of classical simulation in quantum algorithm research.|\n", "2510.24050": "|**2025-10-28**|**Exploiting biased noise in variational quantum models**|Riddhi Gupta|quant-ph; physics.comp-ph|[2510.24050](http://arxiv.org/abs/2510.24050)|17 pages, 7 figures|Variational quantum algorithms (VQAs) are promising tools for demonstrating quantum utility on near-term quantum hardware, with applications in optimisation, quantum simulation, and machine learning. While researchers have studied how easy VQAs are to train, the effect of quantum noise on the classical optimisation process is still not well understood. Contrary to expectations, we find that twirling, which is commonly used in standard error-mitigation strategies to symmetrise noise, actually degrades performance in the variational setting, whereas preserving biased or non-unital noise can help classical optimisers find better solutions. Analytically, we study a universal quantum regression model and demonstrate that relatively uniform Pauli channels suppress gradient magnitudes and reduce expressivity, making optimisation more difficult. Conversely, asymmetric noise such as amplitude damping or biased Pauli channels introduces directional bias that can be exploited during optimisation. Numerical experiments on a variational eigensolver for the transverse-field Ising model confirm that non-unital noise yields lower-energy states compared to twirled noise. Finally, we show that coherent errors are fully mitigated by re-parameterisation. These findings challenge conventional noise-mitigation strategies and suggest that preserving noise biases may enhance VQA performance.|\n", "2510.23489": "|**2025-10-27**|**Quantum Phase Classification of Rydberg Atom Systems Using Resource-Efficient Variational Quantum Circuits and Classical Shadows**|Ziwoong Jang|quant-ph; cs.LG; 81P68|[2510.23489](http://arxiv.org/abs/2510.23489)|7 pages, 2 tables, and 3 figures. for associated code files, see\n  https://github.com/Hemishahuja/FLIQ_Challenge_ClassiqDuQIS|Quantum phase transitions in Rydberg atom arrays present significant opportunities for studying many-body physics, yet distinguishing between different ordered phases without explicit order parameters remains challenging. We present a resource-efficient quantum machine learning approach combining classical shadow tomography with variational quantum circuits (VQCs) for binary phase classification of Z2 and Z3 ordered phases. Our pipeline processes 500 randomized measurements per 51-atom chain state, reconstructs shadow operators, performs PCA dimensionality reduction (514 features), and encodes features using angle embedding onto a 2-qubit parameterized circuit. The circuit employs RY-RZ angle encoding, strong entanglement via all-to-all CZ gates, and a minimal 2-parameter ansatz achieving depth 7. Training via simultaneous perturbation stochastic approximation (SPSA) with hinge loss converged in 120 iterations. The model achieved 100% test accuracy with perfect precision, recall, and F1 scores, demonstrating that minimal quantum resources suffice for high-accuracy phase classification. This work establishes pathways for quantum-enhanced condensed matter physics on near-term quantum devices.|\n", "2510.23304": "|**2025-10-27**|**CNOT Minimal Circuit Synthesis: A Reinforcement Learning Approach**|Paolo Burelli|cs.AI|[2510.23304](http://arxiv.org/abs/2510.23304)||CNOT gates are fundamental to quantum computing, as they facilitate entanglement, a crucial resource for quantum algorithms. Certain classes of quantum circuits are constructed exclusively from CNOT gates. Given their widespread use, it is imperative to minimise the number of CNOT gates employed. This problem, known as CNOT minimisation, remains an open challenge, with its computational complexity yet to be fully characterised. In this work, we introduce a novel reinforcement learning approach to address this task. Instead of training multiple reinforcement learning agents for different circuit sizes, we use a single agent up to a fixed size $m$. Matrices of sizes different from m are preprocessed using either embedding or Gaussian striping. To assess the efficacy of our approach, we trained an agent with m = 8, and evaluated it on matrices of size n that range from 3 to 15. The results we obtained show that our method overperforms the state-of-the-art algorithm as the value of n increases.|\n"}, "ROM": {"2510.25625": "|**2025-10-29**|**HybriNet-Hybrid Neural Network-based framework for Multi-Parametric Database Generation, Enhancement, and Forecasting**|Soledad Le Clainche|physics.flu-dyn|[2510.25625](http://arxiv.org/abs/2510.25625)||In this work, we introduce HybriNet an innovative and robust framework capable of enhancing spatial resolution, generating fluid dynamics databases for specific flow parameters, and predicting their temporal evolution. The methodology is based on the development of a reduced-order model (ROM) by integrating high-order singular value decomposition (HOSVD) with machine learning (ML) and deep learning (DL) techniques. The ROM enables the generation of multi-parametric fluid dynamics databases concerning varying flow conditions, increases the spatial resolution, and predicts the behaviour of the fluid dynamics problem in terms of time. This helps to accelerate numerical simulations and generate new data efficiently. The performance of the proposed approach has been validated using a collection of 30 two-dimensional laminar flow simulations over a square cylinder at different Reynolds numbers and angles of attack. The databases reconstructed using the proposed methodology exhibited a relative root mean square error below 2% when compared to ground-truth high-resolution data, demonstrating the robustness, accuracy, and efficiency of the proposed framework.|\n", "2510.25135": "|**2025-10-29**|**Conditional neural field for spatial dimension reduction of turbulence data: a comparison study**|Jian-Xun Wang|physics.flu-dyn; cs.LG|[2510.25135](http://arxiv.org/abs/2510.25135)||We investigate conditional neural fields (CNFs), mesh-agnostic, coordinate-based decoders conditioned on a low-dimensional latent, for spatial dimensionality reduction of turbulent flows. CNFs are benchmarked against Proper Orthogonal Decomposition and a convolutional autoencoder within a unified encoding-decoding framework and a common evaluation protocol that explicitly separates in-range (interpolative) from out-of-range (strict extrapolative) testing beyond the training horizon, with identical preprocessing, metrics, and fixed splits across all baselines. We examine three conditioning mechanisms: (i) activation-only modulation (often termed FiLM), (ii) low-rank weight and bias modulation (termed FP), and (iii) last-layer inner-product coupling, and introduce a novel domain-decomposed CNF that localizes complexities. Across representative turbulence datasets (WMLES channel inflow, DNS channel inflow, and wall pressure fluctuations over turbulent boundary layers), CNF-FP achieves the lowest training and in-range testing errors, while CNF-FiLM generalizes best for out-of-range scenarios once moderate latent capacity is available. Domain decomposition significantly improves out-of-range accuracy, especially for the more demanding datasets. The study provides a rigorous, physics-aware basis for selecting conditioning, capacity, and domain decomposition when using CNFs for turbulence compression and reconstruction.|\n", "2510.24436": "|**2025-10-28**|**Payne's nodal line conjecture fails on doubly-connected planar domains**|Roméo Leylekian|math.AP; 35J25, 35P05, 35B05|[2510.24436](http://arxiv.org/abs/2510.24436)|13 pages, including 5 figures and the appendix|We present examples of bounded planar domains with one single hole for which the nodal line of a second Dirichlet eigenfunction is closed and does not touch the boundary. This shows that Payne's nodal line conjecture can at most hold for simply-connected domains in the plane.|\n", "2510.23910": "|**2025-10-27**|**Dynamical Modeling of Temperature and Smoke Evolution in a Thermal-Runaway Event of a Large-Format Lithium-ion Battery in a Mine Tunnel**|Ashish Ranjan Kumar|eess.SY; cs.SY|[2510.23910](http://arxiv.org/abs/2510.23910)||Large-format lithium-ion batteries (LIBs) provide effective energy storage solutions for high-power equipment used in underground mining operations. They have high Columbic efficiency and minimal heat and emission footprints. However, improper use of LIBs, accidents, or other factors may increase the probability of thermal runaway (TR), a rapid combustion reaction that discharges toxic and flammable substances. Several such incidents have been documented in mines. Since repeatable TR experiments to uncover the transient-state propagation of TR are expensive and hazardous, high-fidelity models are usually developed to mimic the impact of these events. They are resource-intensive and are impractical to develop for many scenarios that could be observed in a mine. Therefore, dynamic models within a reduced-order framework were constructed to represent the transient-state combustion event. Reduced order models (ROMs) reasonably replicate trends in temperature and smoke, showing strong alignment with the ground-truth dataset.|\n", "2510.23004": "|**2025-10-27**|**MultiLevel Variational MultiScale (ML-VMS) framework for large-scale simulation**|Wing Kam Liu|math.NA; cs.NA|[2510.23004](http://arxiv.org/abs/2510.23004)||In this paper, we propose the MultiLevel Variational MultiScale (ML-VMS) method, a novel approach that seamlessly integrates a multilevel mesh strategy into the Variational Multiscale (VMS) framework. A key feature of the ML-VMS method is the use of the Convolutional Hierarchical Deep Neural Network (C-HiDeNN) as the approximation basis. The framework employs a coarse mesh throughout the domain, with localized fine meshes placed only in subdomains of high interest, such as those surrounding a source. Solutions at different resolutions are robustly coupled through the variational weak form and interface conditions. Compared to existing multilevel methods, ML-VMS (1) can couple an arbitrary number of mesh levels across different scales using variational multiscale framework; (2) allows approximating functions with arbitrary orders with linear finite element mesh due to the C-HiDeNN basis; (3) is supported by a rigorous theoretical error analysis; (4) features several tunable hyperparameters (e.g., order $p$, patch size $s$) with a systematic guide for their selection. We first show the theoretical error estimates of ML-VMS. Then through numerical examples, we demonstrate that ML-VMS with the C-HiDeNN takes less computational time than the FEM basis given comparable accuracy. Furthermore, we incorporate a space-time reduced-order model (ROM) based on C-HiDeNN-Tensor Decomposition (TD) into the ML-VMS framework. For a large-scale single-track laser powder bed fusion (LPBF) transient heat transfer problem that is equivalent to a full-order finite element model with $10^{10}$ spatial degrees of freedom (DoFs), our 3-level ML-VMS C-HiDeNN-TD achieves an approximately 5,000x speedup on a single CPU over a single-level linear FEM-TD ROM.|\n", "2510.22913": "|**2025-10-27**|**Clinic-Oriented Feasibility of a Sensor-Fused Wearable for Upper-Limb Function**|Aueaphum Aueawattthanaphisut|eess.SP; cs.HC; cs.LG; cs.RO; q-bio.NC|[2510.22913](http://arxiv.org/abs/2510.22913)|19 pages, 7 figures, 5 Tables|Background: Upper-limb weakness and tremor (4--12 Hz) limit activities of daily living (ADL) and reduce adherence to home rehabilitation. Objective: To assess technical feasibility and clinician-relevant signals of a sensor-fused wearable targeting the triceps brachii and extensor pollicis brevis. Methods: A lightweight node integrates surface EMG (1 kHz), IMU (100--200 Hz), and flex/force sensors with on-device INT8 inference (Tiny 1D-CNN/Transformer) and a safety-bounded assist policy (angle/torque/jerk limits; stall/time-out). Healthy adults (n = 12) performed three ADL-like tasks. Primary outcomes: Tremor Index (TI), range of motion (ROM), repetitions (Reps min$^{-1}$). Secondary: EMG median-frequency slope (fatigue trend), closed-loop latency, session completion, and device-related adverse events. Analyses used subject-level paired medians with BCa 95\\% CIs; exact Wilcoxon $p$-values are reported in the Results. Results: Assistance was associated with lower tremor prominence and improved task throughput: TI decreased by $-0.092$ (95\\% CI [$-0.102$, $-0.079$]), ROM increased by $+12.65\\%$ (95\\% CI [$+8.43$, $+13.89$]), and Reps rose by $+2.99$ min$^{-1}$ (95\\% CI [$+2.61$, $+3.35$]). Median on-device latency was 8.7 ms at a 100 Hz loop rate; all sessions were completed with no device-related adverse events. Conclusions: Multimodal sensing with low-latency, safety-bounded assistance produced improved movement quality (TI $\\downarrow$) and throughput (ROM, Reps $\\uparrow$) in a pilot technical-feasibility setting, supporting progression to IRB-approved patient studies. Trial registration: Not applicable (pilot non-clinical).|\n", "2510.22772": "|**2025-10-26**|**Neural-HAR: A Dimension-Gated CNN Accelerator for Real-Time Radar Human Activity Recognition**|Chang Gao|eess.SP; cs.CV|[2510.22772](http://arxiv.org/abs/2510.22772)||Radar-based human activity recognition (HAR) is attractive for unobtrusive and privacy-preserving monitoring, yet many CNN/RNN solutions remain too heavy for edge deployment, and even lightweight ViT/SSM variants often exceed practical compute and memory budgets. We introduce Neural-HAR, a dimension-gated CNN accelerator tailored for real-time radar HAR on resource-constrained platforms. At its core is GateCNN, a parameter-efficient Doppler-temporal network that (i) embeds Doppler vectors to emphasize frequency evolution over time and (ii) applies dual-path gated convolutions that modulate Doppler-aware content features with temporal gates, complemented by a residual path for stable training. On the University of Glasgow UoG2020 continuous radar dataset, GateCNN attains 86.4% accuracy with only 2.7k parameters and 0.28M FLOPs per inference, comparable to CNN-BiGRU at a fraction of the complexity. Our FPGA prototype on Xilinx Zynq-7000 Z-7007S reaches 107.5 $\\mu$s latency and 15 mW dynamic power using LUT-based ROM and distributed RAM only (zero DSP/BRAM), demonstrating real-time, energy-efficient edge inference. Code and HLS conversion scripts are available at https://github.com/lab-emi/AIRHAR.|\n", "2510.22406": "|**2025-10-25**|**Data-driven, Wavelet-based Identification and Reduced-order Modeling of Linear Systems with Closely Spaced Modes**|Alexander F. Vakakis|eess.SP|[2510.22406](http://arxiv.org/abs/2510.22406)||This work presents a purely data-driven, wavelet-based framework for modal identification and reduced-order modeling of mechanical systems with assumed linear dynamics characterized by closely spaced modes with classical or non-classical damping distribution. Traditional Fourier-based methods often fail to reliably identify closely spaced modes or accurately capture modal interactions and complexities. To address these limitations, we propose a methodology leveraging the enhanced time -frequency resolution capabilities of the continuous wavelet transform (CWT). By selecting appropriate harmonic regions within the wavelet spectra, we effectively isolate modes, and then invert them back in the temporal domain by applying the inverse CWT (ICWT). In this way we reconstruct the corresponding modal dynamics in the time domain. Using the Hilbert transform, instantaneous phases are extracted for each identified mode, enabling the introduction of a complexified modal matrix which robustly characterizes the system's modal properties, even under challenging perturbations such as noise and uncertainties due to modal interference and unmodeled effects. The identified modal parameters are utilized to reconstruct the frequency response functions (FRFs) of the system and to develop a reduced-order model (ROM) that captures accurately the system's dominant dynamical behavior valid in a specified frequency range.. Validation of the methodology is conducted both with a numerical non-classical damping and an experimental testbed representing a model of an airplane structure. Results demonstrate the effectiveness of the proposed approach in resolving intricate modal interactions and accurately reproducing the dynamic response of complex structural systems.|\n", "2510.22216": "|**2025-10-25**|**Aeroelastic Reduced-Order Model Differential Equations in Transonic Buffeting Flow**|Earl H. Dowell|physics.flu-dyn; physics.comp-ph; physics.data-an|[2510.22216](http://arxiv.org/abs/2510.22216)|32 pages, 20 figures|Numerical simulation of the transonic shock buffet phenomenon remains a formidable challenge due to its inherent nonlinear and unsteady characteristics. These difficulties are further compounded in three-dimensional configurations and when aeroelastic coupling is considered. Consequently, computational studies of aeroelastic shock buffet interactions have largely been confined to two-dimensional systems. This limitation underscores the need for reduced-order models (ROMs) capable of efficiently and accurately capturing the aeroelastic response of structures subjected to shock buffet oscillations. This paper presents a novel nonlinear unsteady aerodynamic ROM that integrates nonlinear oscillator dynamics with Volterra theory to model aeroelastic shock buffet phenomena. The coefficients and terms of the resulting Integro-Differential Equation ROM (IDE-ROM) are identified using the Orthogonal Matching Pursuit (OMP) algorithm. Application of the IDE-ROM to an OAT15A airfoil demonstrates that the compact and computationally efficient formulation can reproduce key nonlinear behaviors, including aeroelastic lock-in, with a high degree of accuracy. The limitations and potential extensions of the proposed approach are also critically examined.|\n", "2510.22077": "|**2025-10-24**|**Preconditioning and Reduced-Order Modeling of Navier-Stokes Equations in Complex Porous Microstructures**|Yashar Mehmani|math.NA; cs.NA; physics.comp-ph|[2510.22077](http://arxiv.org/abs/2510.22077)||We aim to solve the incompressible Navier-Stokes equations within the complex microstructure of a porous material. Discretizing the equations on a fine grid using a staggered (e.g., marker-and-cell, mixed FEM) scheme results in a nonlinear residual. Adopting the Newton method, a linear system must be solved at each iteration, which is large, ill-conditioned, and has a saddle-point structure. This demands an iterative (e.g., Krylov) solver, that requires preconditioning to ensure rapid convergence. We propose two monolithic \\textit{algebraic} preconditioners, $a\\mathrm{PLMM_{NS}}$ and $a\\mathrm{PNM_{NS}}$, that are generalizations of previously proposed forms by the authors for the Stokes equations ($a\\mathrm{PLMM_{S}}$ and $a\\mathrm{PNM_{S}}$). The former is based on the pore-level multiscale method (PLMM) and the latter on the pore network model (PNM), both successful approximate solvers. We also formulate faster-converging geometric preconditioners $g\\mathrm{PLMM}$ and $g\\mathrm{PNM}$, which impose $\\partial_n\\boldsymbol{u}\\!=\\!0$ (zero normal-gradient of velocity) exactly at subdomain interfaces. Finally, we propose an accurate coarse-scale solver for the steady-state Navier-Stokes equations based on $g\\mathrm{PLMM}$, capable of computing approximate solutions orders of magnitude faster. We benchmark our preconditioners against state-of-the-art block preconditioners and show $g\\mathrm{PLMM}$ is the best-performing one, followed closely by $a\\mathrm{PLMM_{S}}$ for steady-state flow and $a\\mathrm{PLMM_{NS}}$ for transient flow. All preconditioners can be built and applied on parallel machines.|\n"}, "PINN": {"2510.25752": "|**2025-10-29**|**Meshless solutions of PDE inverse problems on irregular geometries**|Michael P. Brenner|math.NA; cs.LG; cs.NA; physics.comp-ph|[2510.25752](http://arxiv.org/abs/2510.25752)||Solving inverse and optimization problems over solutions of nonlinear partial differential equations (PDEs) on complex spatial domains is a long-standing challenge. Here we introduce a method that parameterizes the solution using spectral bases on arbitrary spatiotemporal domains, whereby the basis is defined on a hyperrectangle containing the true domain. We find the coefficients of the basis expansion by solving an optimization problem whereby both the equations, the boundary conditions and any optimization targets are enforced by a loss function, building on a key idea from Physics-Informed Neural Networks (PINNs). Since the representation of the function natively has exponential convergence, so does the solution of the optimization problem, as long as it can be solved efficiently. We find empirically that the optimization protocols developed for machine learning find solutions with exponential convergence on a wide range of equations. The method naturally allows for the incorporation of data assimilation by including additional terms in the loss function, and for the efficient solution of optimization problems over the PDE solutions.|\n", "2510.25731": "|**2025-10-29**|**LieSolver: A PDE-constrained solver for IBVPs using Lie symmetries**|Wojciech Samek|cs.LG; cs.AI; cs.NA; math.NA; physics.comp-ph|[2510.25731](http://arxiv.org/abs/2510.25731)||We introduce a method for efficiently solving initial-boundary value problems (IBVPs) that uses Lie symmetries to enforce the associated partial differential equation (PDE) exactly by construction. By leveraging symmetry transformations, the model inherently incorporates the physical laws and learns solutions from initial and boundary data. As a result, the loss directly measures the model's accuracy, leading to improved convergence. Moreover, for well-posed IBVPs, our method enables rigorous error estimation. The approach yields compact models, facilitating an efficient optimization. We implement LieSolver and demonstrate its application to linear homogeneous PDEs with a range of initial conditions, showing that it is faster and more accurate than physics-informed neural networks (PINNs). Overall, our method improves both computational efficiency and the reliability of predictions for PDE-constrained problems.|\n", "2510.24026": "|**2025-10-28**|**Efficient Global-Local Fusion Sampling for Physics-Informed Neural Networks**|Zhouwang Yang|cs.LG|[2510.24026](http://arxiv.org/abs/2510.24026)||The accuracy of Physics-Informed Neural Networks (PINNs) critically depends on the placement of collocation points, as the PDE loss is approximated through sampling over the solution domain. Global sampling ensures stability by covering the entire domain but requires many samples and is computationally expensive, whereas local sampling improves efficiency by focusing on high-residual regions but may neglect well-learned areas, reducing robustness. We propose a Global-Local Fusion (GLF) Sampling Strategy that combines the strengths of both approaches. Specifically, new collocation points are generated by perturbing training points with Gaussian noise scaled inversely to the residual, thereby concentrating samples in difficult regions while preserving exploration. To further reduce computational overhead, a lightweight linear surrogate is introduced to approximate the global residual-based distribution, achieving similar effectiveness at a fraction of the cost. Together, these components, residual-adaptive sampling and residual-based approximation, preserve the stability of global methods while retaining the efficiency of local refinement. Extensive experiments on benchmark PDEs demonstrate that GLF consistently improves both accuracy and efficiency compared with global and local sampling strategies. This study provides a practical and scalable framework for enhancing the reliability and efficiency of PINNs in solving complex and high-dimensional PDEs.|\n", "2510.23999": "|**2025-10-28**|**Auto-Adaptive PINNs with Applications to Phase Transitions**|Woojeong Kim|math.NA; cs.LG; cs.NA|[2510.23999](http://arxiv.org/abs/2510.23999)||We propose an adaptive sampling method for the training of Physics Informed Neural Networks (PINNs) which allows for sampling based on an arbitrary problem-specific heuristic which may depend on the network and its gradients. In particular we focus our analysis on the Allen-Cahn equations, attempting to accurately resolve the characteristic interfacial regions using a PINN without any post-hoc resampling. In experiments, we show the effectiveness of these methods over residual-adaptive frameworks.|\n", "2510.23117": "|**2025-10-27**|**Seeing Structural Failure Before it Happens: An Image-Based Physics-Informed Neural Network (PINN) for Spaghetti Bridge Load Prediction**|Hafeez Anwar|cs.LG; cs.CV; 65M70 (Primary), 68T07 (Secondary); I.2.6; I.4.8; G.1.8|[2510.23117](http://arxiv.org/abs/2510.23117)|12 pages, 17 figures. Preprint|Physics Informed Neural Networks (PINNs) are gaining attention for their ability to embed physical laws into deep learning models, which is particularly useful in structural engineering tasks with limited data. This paper aims to explore the use of PINNs to predict the weight of small scale spaghetti bridges, a task relevant to understanding load limits and potential failure modes in simplified structural models. Our proposed framework incorporates physics-based constraints to the prediction model for improved performance. In addition to standard PINNs, we introduce a novel architecture named Physics Informed Kolmogorov Arnold Network (PIKAN), which blends universal function approximation theory with physical insights. The structural parameters provided as input to the model are collected either manually or through computer vision methods. Our dataset includes 15 real bridges, augmented to 100 samples, and our best model achieves an $R^2$ score of 0.9603 and a mean absolute error (MAE) of 10.50 units. From applied perspective, we also provide a web based interface for parameter entry and prediction. These results show that PINNs can offer reliable estimates of structural weight, even with limited data, and may help inform early stage failure analysis in lightweight bridge designs.   The complete data and code are available at https://github.com/OmerJauhar/PINNS-For-Spaghetti-Bridges.|\n", "2510.22848": "|**2025-10-26**|**Self-induced stochastic resonance: A physics-informed machine learning approach**|Marius E. Yamakou|cs.LG; nlin.AO; stat.ML|[2510.22848](http://arxiv.org/abs/2510.22848)|22 pages, 10 figures, 58 references|Self-induced stochastic resonance (SISR) is the emergence of coherent oscillations in slow-fast excitable systems driven solely by noise, without external periodic forcing or proximity to a bifurcation. This work presents a physics-informed machine learning framework for modeling and predicting SISR in the stochastic FitzHugh-Nagumo neuron. We embed the governing stochastic differential equations and SISR-asymptotic timescale-matching constraints directly into a Physics-Informed Neural Network (PINN) based on a Noise-Augmented State Predictor architecture. The composite loss integrates data fidelity, dynamical residuals, and barrier-based physical constraints derived from Kramers' escape theory. The trained PINN accurately predicts the dependence of spike-train coherence on noise intensity, excitability, and timescale separation, matching results from direct stochastic simulations with substantial improvements in accuracy and generalization compared with purely data-driven methods, while requiring significantly less computation. The framework provides a data-efficient and interpretable surrogate model for simulating and analyzing noise-induced coherence in multiscale stochastic systems.|\n", "2510.21426": "|**2025-10-24**|**A Rapid Physics-Informed Machine Learning Framework Based on Extreme Learning Machine for Inverse Stefan Problems**|He Yang|cs.LG|[2510.21426](http://arxiv.org/abs/2510.21426)||The inverse Stefan problem, as a typical phase-change problem with moving boundaries, finds extensive applications in science and engineering. Recent years have seen the applications of physics-informed neural networks (PINNs) to solving Stefan problems, yet they still exhibit shortcomings in hyperparameter dependency, training efficiency, and prediction accuracy. To address this, this paper develops a physics-informed extreme learning machine (PIELM), a rapid physics-informed learning method framework for inverse Stefan problems. PIELM replaces conventional deep neural networks with an extreme learning machine network. The input weights are fixed in the PIELM framework, and the output weights are determined by optimizing a loss vector of physical laws composed by initial and boundary conditions and governing partial differential equations (PDEs). Then, solving inverse Stefan problems is transformed into finding the Moore-Penrose generalized inverse by the least squares method. Case studies show that the PIELM can increase the prediction accuracy by 3-7 order of magnitude in terms of the relative L2 error, and meanwhile saving more than 94% training time, compared to conventional PINNs.|\n", "2510.21262": "|**2025-10-24**|**PINN Balls: Scaling Second-Order Methods for PINNs with Domain Decomposition and Adaptive Sampling**|Marco Ellero|cs.LG|[2510.21262](http://arxiv.org/abs/2510.21262)|Accepted Conference Paper|Recent advances in Scientific Machine Learning have shown that second-order methods can enhance the training of Physics-Informed Neural Networks (PINNs), making them a suitable alternative to traditional numerical methods for Partial Differential Equations (PDEs). However, second-order methods induce large memory requirements, making them scale poorly with the model size. In this paper, we define a local Mixture of Experts (MoE) combining the parameter-efficiency of ensemble models and sparse coding to enable the use of second-order training. Our model -- \\textsc{PINN Balls} -- also features a fully learnable domain decomposition structure, achieved through the use of Adversarial Adaptive Sampling (AAS), which adapts the DD to the PDE and its domain. \\textsc{PINN Balls} achieves better accuracy than the state-of-the-art in scientific machine learning, while maintaining invaluable scalability properties and drawing from a sound theoretical background.|\n", "2510.21051": "|**2025-10-23**|**Lyapunov-Based Physics-Informed Deep Neural Networks with Skew Symmetry Considerations**|Warren E. Dixon|eess.SY; cs.SY|[2510.21051](http://arxiv.org/abs/2510.21051)||Deep neural networks (DNNs) are powerful black-box function approximators which have been shown to yield improved performance compared to traditional neural network (NN) architectures. However, black-box algorithms do not incorporate known physics of the system and can yield results which are physically implausible. Physics-informed neural networks (PINNs) have grown in popularity due to their ability to leverage known physical principles in the learning process which has been empirically shown to improve performance compared to traditional black-box methods. This paper introduces the first physics-informed DNN controller for an Euler-Lagrange dynamic system where the adaptation laws are designed using a Lyapunov-based stability analysis to account for the skew-symmetry property of the inertia matrix and centripetal-Coriolis matrix. A Lyapunov-based stability analysis is provided to guarantee asymptotic convergence of the tracking error and the skew-symmetric prediction error. Simulations indicate that the developed update law demonstrates improvement in individual and overall function approximation capabilities when compared to a physics-informed adaptation law which does not incorporate knowledge of system symmetries.|\n", "2510.21874": "|**2025-10-23**|**A Physics-Informed Neural Network Approach for UAV Path Planning in Dynamic Environments**|Shuning Zhang|cs.RO; cs.AI|[2510.21874](http://arxiv.org/abs/2510.21874)|15 pages, 8 figures|Unmanned aerial vehicles (UAVs) operating in dynamic wind fields must generate safe and energy-efficient trajectories under physical and environmental constraints. Traditional planners, such as A* and kinodynamic RRT*, often yield suboptimal or non-smooth paths due to discretization and sampling limitations. This paper presents a physics-informed neural network (PINN) framework that embeds UAV dynamics, wind disturbances, and obstacle avoidance directly into the learning process. Without requiring supervised data, the PINN learns dynamically feasible and collision-free trajectories by minimizing physical residuals and risk-aware objectives. Comparative simulations show that the proposed method outperforms A* and Kino-RRT* in control energy, smoothness, and safety margin, while maintaining similar flight efficiency. The results highlight the potential of physics-informed learning to unify model-based and data-driven planning, providing a scalable and physically consistent framework for UAV trajectory optimization.|\n"}, "Turbulence and Fluid Dynamics": {"2510.25730": "|**2025-10-29**|**Confined floating active carpets generate coherent vortical flows that enhance transport**|Francisca Guzman-Lastra|physics.flu-dyn; physics.bio-ph|[2510.25730](http://arxiv.org/abs/2510.25730)|10 pages, 7 figures|Slicks are thin viscous films that can be found at the air--water interface of water bodies such as lakes, rivers and oceans. These micro-layers are enriched in surfactants, organic matter, and microorganisms, and exhibit steep physical and chemical gradients across only tens to hundreds of micrometers. In such geometrically confined environments, the hydrodynamics and transport of nutrients, pollutants, and microorganisms are constrained, yet they collectively sustain key biogenic processes. It remains however largely unexplored how the hydrodynamic flows and transport are affected by the vertical extent of slicks relative to the size of microbial colonies. Here, we study this question by combining analytical and numerical approaches to model a microbial colony as an active carpet: a two-dimensional distribution of micro-swimmers exerting dipolar forces. We show that there exists a ratio between the carpet size and the confinement height that is optimal for the enhancement of particle transport toward the colony edges through advective flows that recirculate in 3D vortex-ring-like patterns with a characteristic length comparable to the confinement height. Our results demonstrate that finite, coherent vortex-ring-like structures can arise solely from the geometrical confinement ratio of slick thickness to microbial colony size. These findings shed light on the interplay between collective activity and out-of-equilibrium transport, and on how microbial communities form, spread, and persist in geometrically constrained environments such as surface slicks.|\n", "2510.25702": "|**2025-10-29**|**An efficient implementation of the bidirectional buffer: towards laminar and turbulent open-boundary flows**|Xiangyu Hu|physics.flu-dyn|[2510.25702](http://arxiv.org/abs/2510.25702)|51 pages, 26 figures and 5 tables|To effectively handle flows characterized by strong backflow and multiple open boundaries within particle-based frameworks, this study introduces three enhancements to improve the consistency, independence, and accuracy of the buffer-based open boundary condition in SPHinXsys. First, to improve the buffer consistency, the continuum hypothesis is introduced to prevent the excessive particle addition induced by strong backflow. Secondly, the independence of the bidirectional buffer is enhanced through region-constrained and independent labeling schemes, which effectively eliminate buffer interference and erroneous particle deletion in complex open-boundary flows. Thirdly, the original zeroth-order consistent pressure boundary condition is upgraded to first-order consistency by introducing a mirror boundary treatment for the correction matrix. The implementation is based on the rigorously validated weakly compressible smoothed particle hydrodynamics coupled with Reynolds-averaged Navier-Stokes (WCSPH-RANS) method, and both laminar and turbulent flow simulations are performed. Four test cases, including straight and U-shaped channel flows, a plane jet, and the flow in a 3D self-rotational micro-mixer, are conducted to comprehensively validate the proposed improvements. Among these cases, the turbulent plane jet is successfully simulated at a moderate resolution within a very compact computational domain involving strong backflow, a condition that is usually challenging for mesh-based methods. The three improvements require only minor modifications to the code framework, yet they yield significant performance gains.|\n", "2510.25683": "|**2025-10-29**|**Graph Network-based Structural Simulator: Graph Neural Networks for Structural Dynamics**|Luca Lomazzi|cs.LG; cs.AI; cs.CE; physics.comp-ph|[2510.25683](http://arxiv.org/abs/2510.25683)|16 pages, 14 figures|Graph Neural Networks (GNNs) have recently been explored as surrogate models for numerical simulations. While their applications in computational fluid dynamics have been investigated, little attention has been given to structural problems, especially for dynamic cases. To address this gap, we introduce the Graph Network-based Structural Simulator (GNSS), a GNN framework for surrogate modeling of dynamic structural problems.   GNSS follows the encode-process-decode paradigm typical of GNN-based machine learning models, and its design makes it particularly suited for dynamic simulations thanks to three key features: (i) expressing node kinematics in node-fixed local frames, which avoids catastrophic cancellation in finite-difference velocities; (ii) employing a sign-aware regression loss, which reduces phase errors in long rollouts; and (iii) using a wavelength-informed connectivity radius, which optimizes graph construction.   We evaluate GNSS on a case study involving a beam excited by a 50kHz Hanning-modulated pulse. The results show that GNSS accurately reproduces the physics of the problem over hundreds of timesteps and generalizes to unseen loading conditions, where existing GNNs fail to converge or deliver meaningful predictions.   Compared with explicit finite element baselines, GNSS achieves substantial inference speedups while preserving spatial and temporal fidelity. These findings demonstrate that locality-preserving GNNs with physics-consistent update rules are a competitive alternative for dynamic, wave-dominated structural simulations.|\n", "2510.25679": "|**2025-10-29**|**Navigation in a Three-Dimensional Urban Flow using Deep Reinforcement Learning**|Ricardo Vinuesa|cs.AI; physics.flu-dyn|[2510.25679](http://arxiv.org/abs/2510.25679)||Unmanned Aerial Vehicles (UAVs) are increasingly populating urban areas for delivery and surveillance purposes. In this work, we develop an optimal navigation strategy based on Deep Reinforcement Learning. The environment is represented by a three-dimensional high-fidelity simulation of an urban flow, characterized by turbulence and recirculation zones. The algorithm presented here is a flow-aware Proximal Policy Optimization (PPO) combined with a Gated Transformer eXtra Large (GTrXL) architecture, giving the agent richer information about the turbulent flow field in which it navigates. The results are compared with a PPO+GTrXL without the secondary prediction tasks, a PPO combined with Long Short Term Memory (LSTM) cells and a traditional navigation algorithm. The obtained results show a significant increase in the success rate (SR) and a lower crash rate (CR) compared to a PPO+LSTM, PPO+GTrXL and the classical Zermelo's navigation algorithm, paving the way to a completely reimagined UAV landscape in complex urban environments.|\n", "2510.25636": "|**2025-10-29**|**Observations of the Relationship between Magnetic Anisotropy and Mode Composition in Low-$β$ Solar Wind Turbulence**|Chuanpeng Hou|astro-ph.SR; physics.plasm-ph; physics.space-ph|[2510.25636](http://arxiv.org/abs/2510.25636)|10 Pages, 8 Figures|Turbulence is a ubiquitous process that transfers energy across many spatial and temporal scales, thereby influencing particle transport and heating. Recent progress has improved our understanding of the anisotropy of turbulence with respect to the mean magnetic field; however, its exact form and implications for magnetic topology and energy transfer remain unclear. In this Letter, we investigate the nature of magnetic anisotropy in compressible magnetohydrodynamic (MHD) turbulence within low-$\\beta$ solar wind using Cluster spacecraft measurements. By decomposing small-amplitude fluctuations into Alfv\\'en and compressible modes, we reveal that the anisotropy is strongly mode dependent: quasi-parallel (`slab') energy contains both Alfv\\'en and compressible modes, whereas quasi-perpendicular (`two-dimensional'; 2D) energy is almost purely Alfv\\'enic, a feature closely linked to collisionless damping of compressible modes. These findings elucidate the physical origin of the long-standing `slab+2D' empirical model and offer a new perspective on the turbulence cascade across the full three-dimensional wavevector space.|\n", "2510.25627": "|**2025-10-29**|**Heterogeneous Wettability Alters Methane Migration and Leakage in Shallow Aquifers**|Mohamad Reza Soltanian|physics.flu-dyn; physics.geo-ph|[2510.25627](http://arxiv.org/abs/2510.25627)|Corresponding authors: Sabber Khandoozi (khandosr@uc.edu) Mohamad\n  Reza Soltanian (soltanma@uc.edu)|Capillary heterogeneity is increasingly recognized as a first-order control on gas plume migration and trapping in aquifers and storage formations. We show that spatial variability in the water-methane contact angle, determined by mineralogy and salinity, alters capillary entry pressures and migration pathways. Using molecular dynamics simulations, we estimate contact angles on quartz and kaolinite under fresh and saline conditions and incorporate these results into continuum-scale multiphase flow simulations via a contact-angle-informed Leverett J function, mapping wettability directly onto continuum-scale flow properties. Accounting for contact angle heterogeneity affects methane behavior: mobile and residually trapped methane in aquifers decrease by up to 10 percent, while leakage to the atmosphere increases by as much as 20 percent. The magnitude of this effect depends on permeability contrast, leakage rate, salinity, and facies proportions. By coupling molecular-scale wettability to continuum-scale flow and transport, this cross-scale framework provides a physically grounded basis for groundwater protection and risk assessment and yields more reliable emissions estimates. The approach can be generalized to other subsurface gas transport problems, including hydrogen and carbon dioxide storage, as well as natural releases such as methane from permafrost thaw.|\n", "2510.25625": "|**2025-10-29**|**HybriNet-Hybrid Neural Network-based framework for Multi-Parametric Database Generation, Enhancement, and Forecasting**|Soledad Le Clainche|physics.flu-dyn|[2510.25625](http://arxiv.org/abs/2510.25625)||In this work, we introduce HybriNet an innovative and robust framework capable of enhancing spatial resolution, generating fluid dynamics databases for specific flow parameters, and predicting their temporal evolution. The methodology is based on the development of a reduced-order model (ROM) by integrating high-order singular value decomposition (HOSVD) with machine learning (ML) and deep learning (DL) techniques. The ROM enables the generation of multi-parametric fluid dynamics databases concerning varying flow conditions, increases the spatial resolution, and predicts the behaviour of the fluid dynamics problem in terms of time. This helps to accelerate numerical simulations and generate new data efficiently. The performance of the proposed approach has been validated using a collection of 30 two-dimensional laminar flow simulations over a square cylinder at different Reynolds numbers and angles of attack. The databases reconstructed using the proposed methodology exhibited a relative root mean square error below 2% when compared to ground-truth high-resolution data, demonstrating the robustness, accuracy, and efficiency of the proposed framework.|\n", "2510.25624": "|**2025-10-29**|**Tidal dissipation and spin-orbit alignment due to the precessional instability in convection zones in rotating giant planets and stars**|Rainer Hollerbach|astro-ph.EP; astro-ph.SR|[2510.25624](http://arxiv.org/abs/2510.25624)|26 pages, 14 figures, 3 tables; accepted for publication in MNRAS|Tidal dissipation in star-planet systems occurs through various mechanisms, including the precessional instability. This is an instability of laminar flows (``Poincar\\'{e} flows\") forced by axial precession of a rotating, oblate, spin-orbit misaligned fluid planet or star, which excites inertial waves in convective regions if the dimensionless precession rate (``Poincar\\'{e} number\" $\\mathrm{Po}$) is sufficiently large. We constrain the contribution of the precessional instability to tidal dissipation and heat transport, using Cartesian hydrodynamical simulations in a small patch of a planet, and study its interaction with turbulent convection, modelled as rotating Rayleigh-B\\'{e}nard convection. The precessional instability without convection results in laminar flow at low values and turbulent flow at sufficiently high values of $\\mathrm{Po}$. The associated tidal dissipation rate scales as $\\mathrm{Po}^2$ and $\\mathrm{Po}^3$ in each regime, respectively. With convection, the Poincar\\'e number at which turbulent flow is achieved shifts to lower values for stronger convective driving. Convective motions also act on large-scale tidal flows like an effective viscosity, resulting in continuous tidal dissipation (scaling as $\\mathrm{Po}^2$), which obfuscates or suppresses tidal dissipation due to precessional instability. The effective viscosities obtained agree with scaling laws previously derived using (rotating) mixing-length theory. By evaluating our scaling laws using interior models of Hot Jupiters, we find that the precessional instability is significantly more efficient than the effective viscosity of convection. The former drives alignment in 1 Gyr for a Jupiter-like planet orbiting within 23 days. Linearly excited inertial waves can be even more effective for wider orbits, aligning spins for orbits within 53-142 days.|\n", "2510.25601": "|**2025-10-29**|**Out-of-equilibrium contributions to charm hadrons in a fluid-dynamic approach**|Silvia Masciocchi|hep-ph; nucl-th|[2510.25601](http://arxiv.org/abs/2510.25601)|14 pages, 6 figures, GitHub repository at:\n  https://github.com/fafafrens/Fluidum.jl|Building on previous studies that demonstrated the applicability of a fluid-dynamic description of charm quarks in the quark-gluon plasma, the present work extends the framework by computing the out-of-equilibrium contributions to the distribution function of charm hadrons. The analysis includes corrections arising from the initial out-of-equilibrium distribution of charm quarks after a free-streaming phase, as well as from the freeze-out surface within fluid dynamics. These results enable the exact computation of integrated yields and transverse momentum distributions of charm hadrons for different values of the spatial diffusion coefficient, thereby providing the basis for a systematic determination of the charm transport coefficients. In addition, the limits of applicability of the approach are identified by determining the transverse-momentum region in which charm hadrons are described by a well-defined, positive distribution function.|\n", "2510.25586": "|**2025-10-29**|**Rush-to-equilibrium concept for minimizing reactive nitrogen emissions in ammonia combustion**|Michael E. Mueller|physics.flu-dyn|[2510.25586](http://arxiv.org/abs/2510.25586)|38 pages, 14 figures, pre-print|Ammonia (NH3) is a zero-carbon fuel that has been receiving increasing attention for power generation and even transportation. Compared to H2, NH3's volumetric energy density is higher, is not as explosive, and has well established transport and storage technologies. Yet, NH3 has poor flammability and flame stability characteristics and more reactive nitrogen (RN: NOx, N2O) emissions than hydrocarbon fuels, at least with traditional combustion processes. Partially cracking NH3 (into a NH3-H2-N2 mixture, AHN) addresses its flammability and stability issues. RN emissions remain a challenge, and mechanisms of their emissions are fundamentally different in NH3 and hydrocarbon combustion. While rich-quench-lean NH3 combustion strategies have shown promise, the largest contributions to RN emissions are the unrelaxed emissions in the fuel-rich stage due to overshoot of thermodynamic equilibrium within the reaction zone of premixed flames coupled with finite residence times available for relaxation to equilibrium. This work introduces a rush-to-equilibrium concept for AHN combustion, which aims to reduce the unrelaxed RN emissions in finite residence times by accelerating the approach to equilibrium. In the concept, a flow particle is subjected to a decaying mixing rate as it transits the premixed flame. This mitigates the mixing effects that prevents the particle approach to equilibrium, and promotes the chemistry effects to push the particle toward equilibrium, all while considering finite residence times. Evaluated with a state-of-the-art combustion model at gas turbine conditions, the concept shows the potential to reduce RN emissions by an order of magnitude, and that works irrespective of cracking extent, pressure, temperature, etc. A brief discussion of possible practical implementation reveals reasonable geometric and flow parameters characteristic of modern gas turbine combustors.|\n"}}